app/Admin/Controllers/ClassController.php

    protected function grid()
    {
        return Admin::grid(ClassSTU::class, function (Grid $grid) {
//            $grid->id('ID')->sortable();
            $grid->rows(function (Grid\Row $row) {
                $row->column('number', $row->number);
            });
            $grid->number('STT');
            $grid->name('Tên lớp')->display(function ($name){
                return '<a href="/admin/class/' . $this->id . '/details">'.$name.'</a>';
            })->sortable();
            $grid->id_user_teacher('GV cố vấn')->display(function ($idTeacher){
                if(!empty($idTeacher)){
                    $nameTeacher = UserAdmin::find($idTeacher)->name;
                    return "<span class='label label-success'>{$nameTeacher}</span>";
                } else {
                    return $idTeacher = '';
                }
            })->sortable();
            $grid->id_department('Tên khoa')->display(function ($idDepartment){
                if($idDepartment) {
                    return Department::find($idDepartment)->name;
                } else {
                    return '';
                }
            })->sortable();
---
select * from `department` where `department`.`id` = '1' limit 1
select * from `department`

    protected function gridStudent($idClass)
    {
        return Admin::grid(StudentUser::class, function (Grid $grid) use ($idClass) {
            $grid->model()->where('id_class', $idClass);
            $grid->rows(function (Grid\Row $row) {
                $row->column('number', $row->number);
            });
            $grid->number('STT');
//            $grid->id('ID')->sortable();
//            $grid->avatar('Avatar')->image();
            $grid->code_number('Mã số sinh viên')->sortable();
            $grid->first_name('Họ')->sortable();
            $grid->last_name('Tên')->display(function ($name){
                return  '<a href="/admin/student_user/' . $this->id . '/details">'.$name.'</a>';
            })->sortable();
            $grid->email('Email')->sortable();
            $grid->id_class('Lớp')->display(function ($idClass){
                if($idClass){
                    return ClassSTU::find($idClass)->name;
                } else {
                    return 'Không có';
                }
            })->sortable();
---
select * from `class` where `class`.`id` = '1' and `class`.`deleted_at` is null limit 1