app/Admin/Controllers/DepartmentController.php

    protected function gridClass($idClass)
    {
        return Admin::grid(ClassSTU::class, function (Grid $grid) use ($idClass) {
            $grid->model()->whereIn('id', $idClass);
            $grid->id('ID')->sortable();
            $grid->name('Tên lớp');
            $grid->id_department('Tên khoa')->display(function ($idDepartment){
                if($idDepartment) {
                    return Department::find($idDepartment)->name;
                } else {
                    return '';
                }
            });
---
select * from `department` where `department`.`id` = '1' limit 1

    public function details($id){
        return Admin::content(function (Content $content) use ($id) {
            $department = Department::findOrFail($id);
            $content->header('Khoa');
            $content->description($department->name);
            $content->body($this->detailsView($id));
        });
---
select * from `department` where `department`.`id` = '1' limit 1