app/Admin/Controllers/StudentUserController.php

    protected function grid()
    {
        return Admin::grid(StudentUser::class, function (Grid $grid) {
            $grid->model()->orderBy('created_at', 'DESC');
//            $grid->rows(function (Grid\Row $row) {
//                $row->column('number', $row->number);
//            });
//            $grid->number('STT');
//            $grid->id('ID')->sortable();
//            $grid->avatar('Avatar')->image();
            $grid->code_number('Mã số sinh viên')->sortable();
            $grid->first_name('Họ')->sortable();
            $grid->last_name('Tên')->display(function ($name){
                return  '<a href="/admin/student_user/' . $this->id . '/details">'.$name.'</a>';
            })->sortable();
//            $grid->username('Tên đăng nhập');
            $grid->email('Email')->sortable();
            $grid->id_class('Lớp')->display(function ($idClass){
                if($idClass){
                    if( ClassSTU::find($idClass)) {
                        return ClassSTU::find($idClass)->name;
                    } else {
                        return '';
                    }
                } else {
                    return 'Không có';
                }
            })->sortable();
            $grid->school_year('Năm nhập học')->sortable();
//            $grid->level('Trình độ')->sortable();
            $grid->id_status('Trạng thái')->display(function ($idStatus){
                $status = Status::find($idStatus);
                if(!empty($status->status)){
                    return $status->status;
                } else {
                    return '';
                }
            });
---
select * from `class` where `class`.`id` = '1' and `class`.`deleted_at` is null limit 1
select * from `status` where `status`.`deleted_at` is null
select * from `class` where `class`.`deleted_at` is null