app/Admin/Controllers/SubjectsController.php

    protected function grid()
    {
        return Admin::grid(Subjects::class, function (Grid $grid) {
//            debug($this->id);
//            $grid->model()->where();
            $grid->id('ID')->sortable();
            $grid->subject_code('Mã môn học');
            $grid->name('Tên môn học')->display(function ($name){
                return  '<a href="/admin/subject/' . $this->id . '/details" >'.$name.'</a>';
            });
            $grid->credits('Số tín chỉ');
            $grid->credits_fee('Số tín chỉ học phí');
            $grid->column('Học kỳ - Năm')->display(function () {
                $id = $this->id;
                $subject = Subjects::find($id);
                $arraySemester = $subject->semester()->pluck('id')->toArray();
                $name = array_map( function ($arraySemester){
                    $nameSemester = Semester::find($arraySemester)->name;
                    switch ($nameSemester) {
                        case 0:
                            $nameSemester = 'Học kỳ hè';
                            break;
                        case 1:
                            $nameSemester = 'Học kỳ 1';
                            break;
                        case 2:
                            $nameSemester = 'Học kỳ 2';
                            break;
                        default:
                            $nameSemester = '';
                            break;
                    }
                    $year = Semester::find($arraySemester)->year()->get();
                    $nameYear = $year['0']->name;
                    return "<span class='label label-info'>{$nameSemester} - {$nameYear}</span>"  ;
                }, $arraySemester);
---
select * from `subjects` where `subjects`.`id` = '1' and `subjects`.`deleted_at` is null limit 1
select `id` from `semester` inner join `semester_subjects` on `semester`.`id` = `semester_subjects`.`semester_id` where `semester_subjects`.`subjects_id` = '1' and `semester`.`deleted_at` is null
select * from `year` where `year`.`id` = '1' and `year`.`deleted_at` is null
select * from `semester` where `semester`.`id` = '3' and `semester`.`deleted_at` is null limit 1

                },$nameGroup);
                return join('&nbsp;', $groupSubject);
            });
            $grid->id_rate('Tỷ lệ chuyên cần')->display(function ($rate){
                if($rate){
                    return Rate::find($rate)->attendance;
                } else {
                    return '';
                }
            });
            $grid->column('Tỷ lệ giữa kì')->display(function (){
                if($this->id_rate) {
                    return Rate::find($this->id_rate)->midterm;
                } else {
                    return '';
                }
            });
            $grid->column('Tỷ lệ cuối kì')->display(function (){
                if($this->id_rate) {
                    return Rate::find($this->id_rate)->end_term;
                } else {
                    return '';
                }
            });
            $grid->created_at();
            $grid->updated_at();
            //action
            $grid->actions(function ($actions) {
                $actions->append('<a href="/admin/subject/' . $actions->getKey() . '/details"><i class="fa fa-eye"></i></a>');
            });
        });
---
select * from `rate` where `rate`.`id` = '2' and `rate`.`deleted_at` is null limit 1
select * from `rate` where `rate`.`deleted_at` is null