app/Admin/Controllers/SubjectBeforeAfterController.php

select * from `subjects` where `subjects`.`id` = '1' and `subjects`.`deleted_at` is null limit 1
select * from `subjects` where `subjects`.`id` = '2' and `subjects`.`deleted_at` is null limit 1
---
    protected function grid()
    {
        return Admin::grid(SubjectBeforeAfter::class, function (Grid $grid) {

//            $grid->id('ID')->sortable();
            $grid->id_subject_before('Môn học trước')->display(function ($idSubjectBefore){
                if($idSubjectBefore)
                {
                    $name = Subjects::find($idSubjectBefore)->name;
                    return '<a href="/admin/subject/' . $idSubjectBefore . '/details">'.$name.'</a>';
                } else {
                    return '';
                }
            });
            $grid->id_subject_after('Môn học sau')->display(function ($idSubjectAfter){
                if($idSubjectAfter)
                {
                    $name = Subjects::find($idSubjectAfter)->name;

select * from `subjects` where `subjects`.`deleted_at` is null
---
    protected function form()
    {
        return Admin::form(SubjectBeforeAfter::class, function (Form $form) {

            $form->display('id', 'ID');
            $form->select('id_subject_before', 'Môn tiên quyết')->options(Subjects::all()->pluck('name', 'id'))->rules('required');
            $form->select('id_subject_after', 'Môn học sau')->options(Subjects::all()->pluck('name', 'id'))->rules('required');
            $form->saving(function (Form $form) {
                if($form->id_subject_before == $form->id_subject_after) {
                    $error = new MessageBag([
                        'title'   => 'Lỗi',
                        'message' => 'Môn tiên quyết và môn sau không được giống nhau',
                    ]);
                    return back()->with(compact('error'));
                }
            });