app/Admin/Controllers/SubjectParallelController.php

select * from `subjects` where `subjects`.`id` = '2' and `subjects`.`deleted_at` is null limit 1
select * from `subjects` where `subjects`.`id` = '4' and `subjects`.`deleted_at` is null limit 1
select * from `subjects` where `subjects`.`deleted_at` is null
---
    protected function grid()
    {
        return Admin::grid(SubjectParallel::class, function (Grid $grid) {
//            $grid->rows(function (Grid\Row $row) {
//                $row->column('number', $row->number);
//            });
//            $grid->number('STT');
            $grid->id('ID')->sortable();
            $grid->id_subject1('Môn học 1')->display(function ($idSubject1){
                $subject1 = Subjects::find($idSubject1);
                if(!empty($subject1->name)){
                    return '<a href="/admin/subject/' . $idSubject1 . '/details">'.$subject1->name.'</a>';
                } else {
                    return '';
                }
            })->sortable();
            $grid->id_subject2('Môn học 2')->display(function ($idSubject2){
                $subject2 = Subjects::find($idSubject2);
                if(!empty($subject2->name)){
                    return '<a href="/admin/subject/' . $idSubject2 . '/details">'.$subject2->name.'</a>';
                } else {
                    return '';
                }
            })->sortable();