app/Admin/Controllers/SubjectRegisterController.php

    protected function grid()
    {
        return Admin::grid(SubjectRegister::class, function (Grid $grid) {

            $grid->id('ID')->sortable();
            $grid->code_subject_register('Mã học phần')->display(function ($name){
                return  '<a href="/admin/subject_register/' . $this->id . '/details">'.$name.'</a>';
            });
            $grid->id_subjects('Môn học')->display(function ($idSubject){
                if($idSubject){
                    $name = Subjects::find($idSubject)->name;
                    return "<span class='label label-info'>{$name}</span>";
                } else {
                    return '';
                }
            });
            $grid->id_classroom('Phòng học')->display(function ($id_classroom){
                if($id_classroom){
                    return Classroom::find($id_classroom)->name;
                } else {
                    return '';
                }
            });
            $grid->id_user_teacher('Giảng viên')->display(function ($id_user_teacher){
                if($id_user_teacher){
                    $teacher = UserAdmin::find($id_user_teacher);
                    if($teacher){
                        return $teacher->name;
                    } else {
                        return '';
                    }
                } else {
                    return '';
                }
            });
---
select * from `subjects` where `subjects`.`id` = '2' and `subjects`.`deleted_at` is null limit 1
select * from `class_room` where `class_room`.`id` = '1' and `class_room`.`deleted_at` is null limit 1
select * from `user_admin` where `user_admin`.`id` = '21' and `user_admin`.`deleted_at` is null limit 1

                return 'required|unique:subject_register,code_subject_register,'.$form->model()->id.',id';
            });
            $form->select('id_subjects', 'Môn học')->options(Subjects::all()->pluck('name', 'id'))->rules('required');
            $form->select('id_user_teacher', 'Giảng viên')->options(UserAdmin::where('type_user', '0')->pluck('name', 'id'))->rules('required');
            $form->hidden('qty_current', 'Số lượng hiện tại')->value('0');
---
select `name`, `id` from `user_admin` where `type_user` = '0' and `user_admin`.`deleted_at` is null
select * from `subjects` where `subjects`.`deleted_at` is null