app/Http/Controllers/StudentInformationController.php

    protected function grid()
    {
        return User::grid(StudentUser::class, function (Grid $grid) {

            $grid->id('ID')->sortable();
            $grid->avatar('Avatar')->image();
            $grid->first_name('Họ');
            $grid->last_name('Tên')->display(function ($name){
                return  '<a href="/admin/student_user/' . $this->id . '/details">'.$name.'</a>';
            });
            $grid->code_number('Mã số sinh viên');
            $grid->username('Tên đăng nhập');
            $grid->email('Email');
            $grid->id_class('Lớp')->display(function ($idClass){
                if($idClass){
                    return ClassSTU::find($idClass)->name;
                } else {
                    return 'Không có';
                }
            });
---
select * from `class` where `class`.`deleted_at` is null