app/Http/Controllers/SubjectRegisterController.php

select * from `year` where `year`.`id` = '1' and `year`.`deleted_at` is null
select `id` from `semester` inner join `semester_subjects` on `semester`.`id` = `semester_subjects`.`semester_id` where `semester_subjects`.`subjects_id` = '4' and `semester`.`deleted_at` is null
select * from `subjects` where `subjects`.`id` = '4' and `subjects`.`deleted_at` is null limit 1
---
    protected function grid()
    {
        return User::GridUser(Subjects::class, function (GridUser $grid) {
            $grid->registerColumnDisplayer();
            //  $grid->rows(function (RowUser $row) {
            //     $row->column('number', $row->number);
            // });
            // $grid->number('STT');
            $user = Auth::user();

            $schoolYearUser = $user->school_year;
            //check school year
            $timeRegister = TimeRegister::where('status', 1)->orderBy('id', 'DESC')->first();
//             $schoolYearUser = (string) $schoolYearUser;
            if ($timeRegister) {
//                 //get school year in time register and school year = "ALL"
//                 if(in_array($schoolYearUser, $timeRegister->school_year) || $timeRegister->school_year['0'] == "All") {
//                 } else {
//                     $grid->model()->where('id', -1);
//                 }

                //open subject register follow semester
                $nameSemester = $timeRegister->semester;