app/Http/Controllers/SubjectRegisterController.php

    protected function grid()
    {
        return User::grid(Subjects::class, function (Grid $grid) {
            $grid->registerColumnDisplayer();
            $user = Auth::user();
             $schoolYearUser = $user->school_year;
             //check school year
             $timeRegister = TimeRegister::where('status', 1)->orderBy('id', 'DESC')->first();
//             $schoolYearUser = (string) $schoolYearUser;
             if($timeRegister) {
//                 //get school year in time register and school year = "ALL"
//                 if(in_array($schoolYearUser, $timeRegister->school_year) || $timeRegister->school_year['0'] == "All") {
//                 } else {
//                     $grid->model()->where('id', -1);
//                 }

                 //open subject register follow semester
                 $nameSemester = $timeRegister->semester;
                 $idSemester = Semester::where('name', $nameSemester)->pluck('id');
                 $subjects_id = SemesterSubjects::whereIn('semester_id', $idSemester)->orderBy('semester_id', 'DESC')->pluck('subjects_id')->toArray();
                 //sort follow semester
                 $field = '';
                 foreach ($subjects_id as $id) {
---
select `id` from `semester` where `status` = '1' and `semester`.`deleted_at` is null
select `subjects_id` from `semester_subjects` where `semester_id` in ('2') order by `semester_id` desc