app/Http/Controllers/SubjectsParallelController.php

    protected function grid()
    {
        return User::grid(SubjectParallel::class, function (Grid $grid) {

            $grid->id('ID')->sortable();
            $grid->id_subject1('Môn học trước')->display(function ($idSubject1){
                $name = Subjects::find($idSubject1)->name;
                return $name;
            });
            $grid->id_subject2('Môn học song song')->display(function ($idSubject2){
                $name = Subjects::find($idSubject2)->name;
---
select * from `subjects` where `subjects`.`id` = '2' and `subjects`.`deleted_at` is null limit 1
select * from `subjects` where `subjects`.`id` = '4' and `subjects`.`deleted_at` is null limit 1